0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
  /*  inlet
    {
        type            fixedValue;
        value			uniform (0 1.16 0);
    }*/

   inlet
   {
    type				flowRateInletVelocity;
    volumetricFlowRate				0.0114; //Qd=0.0053m3/s : 11.36L/s
    extrapolateProfile  yes;
    value				uniform (0 0 0);
    } 
    outlet
    {
        type            zeroGradient;
    }
    concreteWall
    {
        type            fixedValue;
        value			uniform (0 0 0);
    }
    pipe1
    {
        type            fixedValue;
        value			uniform (0 0 0);
    }
    pipe2
    {
        type            fixedValue;
        value			uniform (0 0 0);
    }
    restante
    {
        type            fixedValue;
        value			uniform (0 0 0);
    }
    atmosphere
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

}


// ************************************************************************* //
